"""

Необходимо создать (не программно) текстовый файл,
где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
Вывести словарь на экран.

Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб)
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""


def create_dict(file_line):
    """словарь, где ключ - предмет, а значение - общее количество часов"""
    study_list = file_line.split()
    hours = 0

    for el in study_list:
        if "(" in el:
            hours += int(el[:el.index("(")])

    return {study_list[0][:-1]: hours}


with open("5_6_Studies.txt", "r", encoding="utf-8") as f:
    study_dict = {}
    for line in f.readlines():
        study_dict.update(create_dict(line))

print(study_dict)
